[NoCoverage] BlockStatement
api/src/routes/nwave-runs.ts:41:42
   exit_code: number | null;
 };
 
-function toRunResponse(row: NwaveRunRow) {
-  return {
-    id: row.id,
-    ticketRef: row.ticket_ref,
-    channelId: row.channel_id,
-    status: row.status,
-    currentWave: row.current_wave,
-    restatementText: row.restatement_text,
-    confirmedAt: row.confirmed_at,
-    startedAt: row.started_at,
-    endedAt: row.ended_at,
-    failureReason: row.failure_reason,
-  };
-}
+function toRunResponse(row: NwaveRunRow) {}
 
 function toWaveResponse(row: NwaveRunWaveRow) {

[NoCoverage] ObjectLiteral
api/src/routes/nwave-runs.ts:42:10
 };
 
 function toRunResponse(row: NwaveRunRow) {
-  return {
-    id: row.id,
-    ticketRef: row.ticket_ref,
-    channelId: row.channel_id,
-    status: row.status,
-    currentWave: row.current_wave,
-    restatementText: row.restatement_text,
-    confirmedAt: row.confirmed_at,
-    startedAt: row.started_at,
-    endedAt: row.ended_at,
-    failureReason: row.failure_reason,
-  };
+  return {};
 }
 

[NoCoverage] BlockStatement
api/src/routes/nwave-runs.ts:56:47
   };
 }
 
-function toWaveResponse(row: NwaveRunWaveRow) {
-  return {
-    id: row.id,
-    runId: row.run_id,
-    waveName: row.wave_name,
-    sequence: row.sequence,
-    processId: row.process_id,
-    status: row.status,
-    startedAt: row.started_at,
-    endedAt: row.ended_at,
-    exitCode: row.exit_code,
-  };
-}
+function toWaveResponse(row: NwaveRunWaveRow) {}
 
 function generateRunId(): string {

[NoCoverage] BlockStatement
api/src/routes/nwave-runs.ts:70:34
   };
 }
 
-function generateRunId(): string {
-  return `RUN-${randomUUID().replace(/-/g, "").slice(0, 8).toUpperCase()}`;
-}
+function generateRunId(): string {}
 
 function requireNonEmptyTrimmedString(raw: unknown): string {

[NoCoverage] MethodExpression
api/src/routes/nwave-runs.ts:71:17
 }
 
 function generateRunId(): string {
-  return `RUN-${randomUUID().replace(/-/g, "").slice(0, 8).toUpperCase()}`;
+  return `RUN-${randomUUID().replace(/-/g, "").toUpperCase()}`;
 }
 

[NoCoverage] MethodExpression
api/src/routes/nwave-runs.ts:71:17
 }
 
 function generateRunId(): string {
-  return `RUN-${randomUUID().replace(/-/g, "").slice(0, 8).toUpperCase()}`;
+  return `RUN-${randomUUID().replace(/-/g, "").slice(0, 8).toLowerCase()}`;
 }
 

[NoCoverage] BlockStatement
api/src/routes/nwave-runs.ts:74:61
   return `RUN-${randomUUID().replace(/-/g, "").slice(0, 8).toUpperCase()}`;
 }
 
-function requireNonEmptyTrimmedString(raw: unknown): string {
-  return typeof raw === "string" ? raw.trim() : "";
-}
+function requireNonEmptyTrimmedString(raw: unknown): string {}
 
 function requireNonEmptyString(raw: unknown): string {

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:75:10
 }
 
 function requireNonEmptyTrimmedString(raw: unknown): string {
-  return typeof raw === "string" ? raw.trim() : "";
+  return false ? raw.trim() : "";
 }
 

[NoCoverage] MethodExpression
api/src/routes/nwave-runs.ts:75:36
 }
 
 function requireNonEmptyTrimmedString(raw: unknown): string {
-  return typeof raw === "string" ? raw.trim() : "";
+  return typeof raw === "string" ? raw : "";
 }
 

[NoCoverage] BlockStatement
api/src/routes/nwave-runs.ts:78:54
   return typeof raw === "string" ? raw.trim() : "";
 }
 
-function requireNonEmptyString(raw: unknown): string {
-  return typeof raw === "string" ? raw : "";
-}
+function requireNonEmptyString(raw: unknown): string {}
 
 function notImplemented(label: string) {

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:79:10
 }
 
 function requireNonEmptyString(raw: unknown): string {
-  return typeof raw === "string" ? raw : "";
+  return true ? raw : "";
 }
 

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:79:10
 }
 
 function requireNonEmptyString(raw: unknown): string {
-  return typeof raw === "string" ? raw : "";
+  return false ? raw : "";
 }
 

[Survived] BlockStatement
api/src/routes/nwave-runs.ts:82:40
   return typeof raw === "string" ? raw : "";
 }
 
-function notImplemented(label: string) {
-  return async () => {
-    throw new Error(`${label} not implemented`);
-  };
-}
+function notImplemented(label: string) {}
 
 /**

[NoCoverage] BlockStatement
api/src/routes/nwave-runs.ts:83:22
 }
 
 function notImplemented(label: string) {
-  return async () => {
-    throw new Error(`${label} not implemented`);
-  };
+  return async () => {};
 }
 

[NoCoverage] BlockStatement
api/src/routes/nwave-runs.ts:103:56
  * local, since it serves a different type-safety need than wave-runner.ts's strongly-typed
  * `nextWaveAfter(WaveName)` (also sourced from the same shared `WAVE_SEQUENCE`).
  */
-function nextWaveName(waveName: string): string | null {
-  const currentIndex = WAVE_SEQUENCE.indexOf(waveName as (typeof WAVE_SEQUENCE)[number]);
-  if (currentIndex === -1) return null;
-  return WAVE_SEQUENCE[currentIndex + 1] ?? null;
-}
+function nextWaveName(waveName: string): string | null {}
 
 /**

[NoCoverage] EqualityOperator
api/src/routes/nwave-runs.ts:105:7
  */
 function nextWaveName(waveName: string): string | null {
   const currentIndex = WAVE_SEQUENCE.indexOf(waveName as (typeof WAVE_SEQUENCE)[number]);
-  if (currentIndex === -1) return null;
+  if (currentIndex !== -1) return null;
   return WAVE_SEQUENCE[currentIndex + 1] ?? null;
 }

[NoCoverage] UnaryOperator
api/src/routes/nwave-runs.ts:105:24
  */
 function nextWaveName(waveName: string): string | null {
   const currentIndex = WAVE_SEQUENCE.indexOf(waveName as (typeof WAVE_SEQUENCE)[number]);
-  if (currentIndex === -1) return null;
+  if (currentIndex === +1) return null;
   return WAVE_SEQUENCE[currentIndex + 1] ?? null;
 }

[NoCoverage] ArithmeticOperator
api/src/routes/nwave-runs.ts:106:24
 function nextWaveName(waveName: string): string | null {
   const currentIndex = WAVE_SEQUENCE.indexOf(waveName as (typeof WAVE_SEQUENCE)[number]);
   if (currentIndex === -1) return null;
-  return WAVE_SEQUENCE[currentIndex + 1] ?? null;
+  return WAVE_SEQUENCE[currentIndex - 1] ?? null;
 }
 

[NoCoverage] LogicalOperator
api/src/routes/nwave-runs.ts:106:10
 function nextWaveName(waveName: string): string | null {
   const currentIndex = WAVE_SEQUENCE.indexOf(waveName as (typeof WAVE_SEQUENCE)[number]);
   if (currentIndex === -1) return null;
-  return WAVE_SEQUENCE[currentIndex + 1] ?? null;
+  return WAVE_SEQUENCE[currentIndex + 1] && null;
 }
 

[NoCoverage] BooleanLiteral
api/src/routes/nwave-runs.ts:118:7
  * is incomplete.
  */
 function stopTrackedProcess(orm: OrgOpsDrizzleDb, processId: string | null): void {
-  if (!processId) return;
+  if (processId) return;
 
   const processRow = orm

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:118:7
  * is incomplete.
  */
 function stopTrackedProcess(orm: OrgOpsDrizzleDb, processId: string | null): void {
-  if (!processId) return;
+  if (false) return;
 
   const processRow = orm

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:129:7
     .from(schema.processes)
     .where(eq(schema.processes.id, processId))
     .get() as { id: string; pid: number | null; state: string } | undefined;
-  if (!processRow) return;
+  if (false) return;
 
   const isActive = processRow.state === "RUNNING" || processRow.state === "STARTING";

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:129:7
     .from(schema.processes)
     .where(eq(schema.processes.id, processId))
     .get() as { id: string; pid: number | null; state: string } | undefined;
-  if (!processRow) return;
+  if (true) return;
 
   const isActive = processRow.state === "RUNNING" || processRow.state === "STARTING";

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:131:54
     .get() as { id: string; pid: number | null; state: string } | undefined;
   if (!processRow) return;
 
-  const isActive = processRow.state === "RUNNING" || processRow.state === "STARTING";
+  const isActive = processRow.state === "RUNNING" || false;
   if (!isActive) return;
 

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:131:20
     .get() as { id: string; pid: number | null; state: string } | undefined;
   if (!processRow) return;
 
-  const isActive = processRow.state === "RUNNING" || processRow.state === "STARTING";
+  const isActive = true;
   if (!isActive) return;
 

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:132:7
   if (!processRow) return;
 
   const isActive = processRow.state === "RUNNING" || processRow.state === "STARTING";
-  if (!isActive) return;
+  if (true) return;
 
   if (processRow.pid !== null && processRow.pid !== undefined) {

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:132:7
   if (!processRow) return;
 
   const isActive = processRow.state === "RUNNING" || processRow.state === "STARTING";
-  if (!isActive) return;
+  if (false) return;
 
   if (processRow.pid !== null && processRow.pid !== undefined) {

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:134:34
   const isActive = processRow.state === "RUNNING" || processRow.state === "STARTING";
   if (!isActive) return;
 
-  if (processRow.pid !== null && processRow.pid !== undefined) {
+  if (processRow.pid !== null && true) {
     try {
       process.kill(processRow.pid, "SIGTERM");

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:134:7
   const isActive = processRow.state === "RUNNING" || processRow.state === "STARTING";
   if (!isActive) return;
 
-  if (processRow.pid !== null && processRow.pid !== undefined) {
+  if (false) {
     try {
       process.kill(processRow.pid, "SIGTERM");

[NoCoverage] BlockStatement
api/src/routes/nwave-runs.ts:135:9
   if (!isActive) return;
 
   if (processRow.pid !== null && processRow.pid !== undefined) {
-    try {
-      process.kill(processRow.pid, "SIGTERM");
-    } catch {
+    try {} catch {
       // Best-effort: the OS process may already have exited.
     }

[NoCoverage] BlockStatement
api/src/routes/nwave-runs.ts:149:73
     .run();
 }
 
-function determineWaveOutcome(exitCode: number): "COMPLETED" | "FAILED" {
-  return exitCode === 0 ? "COMPLETED" : "FAILED";
-}
+function determineWaveOutcome(exitCode: number): "COMPLETED" | "FAILED" {}
 
 function applyFailedRunTransition(

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:150:10
 }
 
 function determineWaveOutcome(exitCode: number): "COMPLETED" | "FAILED" {
-  return exitCode === 0 ? "COMPLETED" : "FAILED";
+  return false ? "COMPLETED" : "FAILED";
 }
 

[NoCoverage] EqualityOperator
api/src/routes/nwave-runs.ts:150:10
 }
 
 function determineWaveOutcome(exitCode: number): "COMPLETED" | "FAILED" {
-  return exitCode === 0 ? "COMPLETED" : "FAILED";
+  return exitCode !== 0 ? "COMPLETED" : "FAILED";
 }
 

[NoCoverage] BlockStatement
api/src/routes/nwave-runs.ts:156:9
 function applyFailedRunTransition(
   orm: OrgOpsDrizzleDb,
   input: { runId: string; waveName: string; exitCode: number; failureReason: string | null; now: number },
-): void {
-  orm
-    .update(schema.nwaveRuns)
-    .set({
-      status: "FAILED",
-      ended_at: input.now,
-      failure_reason: input.failureReason ?? `${input.waveName} exited with code ${input.exitCode}`,
-    })
-    .where(eq(schema.nwaveRuns.id, input.runId))
-    .run();
-}
+): void {}
 
 function applyCompletedRunTransition(

[NoCoverage] LogicalOperator
api/src/routes/nwave-runs.ts:162:23
     .set({
       status: "FAILED",
       ended_at: input.now,
-      failure_reason: input.failureReason ?? `${input.waveName} exited with code ${input.exitCode}`,
+      failure_reason: input.failureReason && `${input.waveName} exited with code ${input.exitCode}`,
     })
     .where(eq(schema.nwaveRuns.id, input.runId))

[NoCoverage] BlockStatement
api/src/routes/nwave-runs.ts:171:9
 function applyCompletedRunTransition(
   orm: OrgOpsDrizzleDb,
   input: { runId: string; waveName: string; now: number },
-): void {
-  const next = nextWaveName(input.waveName);
-  if (next === null) {
-    orm
-      .update(schema.nwaveRuns)
-      .set({ status: "COMPLETED", ended_at: input.now, current_wave: null })
-      .where(eq(schema.nwaveRuns.id, input.runId))
-      .run();
-    return;
-  }
-
-  orm
-    .update(schema.nwaveRuns)
-    .set({ current_wave: next })
-    .where(eq(schema.nwaveRuns.id, input.runId))
-    .run();
-}
+): void {}
 
 function haltActiveWaves(orm: OrgOpsDrizzleDb, activeWaves: NwaveRunWaveRow[], now: number): void {

[NoCoverage] BlockStatement
api/src/routes/nwave-runs.ts:173:22
   input: { runId: string; waveName: string; now: number },
 ): void {
   const next = nextWaveName(input.waveName);
-  if (next === null) {
-    orm
-      .update(schema.nwaveRuns)
-      .set({ status: "COMPLETED", ended_at: input.now, current_wave: null })
-      .where(eq(schema.nwaveRuns.id, input.runId))
-      .run();
-    return;
-  }
+  if (next === null) {}
 
   orm

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:173:7
   input: { runId: string; waveName: string; now: number },
 ): void {
   const next = nextWaveName(input.waveName);
-  if (next === null) {
+  if (true) {
     orm
       .update(schema.nwaveRuns)

[NoCoverage] ObjectLiteral
api/src/routes/nwave-runs.ts:176:12
   if (next === null) {
     orm
       .update(schema.nwaveRuns)
-      .set({ status: "COMPLETED", ended_at: input.now, current_wave: null })
+      .set({})
       .where(eq(schema.nwaveRuns.id, input.runId))
       .run();

[NoCoverage] ObjectLiteral
api/src/routes/nwave-runs.ts:184:10
 
   orm
     .update(schema.nwaveRuns)
-    .set({ current_wave: next })
+    .set({})
     .where(eq(schema.nwaveRuns.id, input.runId))
     .run();

[NoCoverage] BlockStatement
api/src/routes/nwave-runs.ts:189:99
     .run();
 }
 
-function haltActiveWaves(orm: OrgOpsDrizzleDb, activeWaves: NwaveRunWaveRow[], now: number): void {
-  for (const activeWave of activeWaves) {
-    stopTrackedProcess(orm, activeWave.process_id);
-    orm
-      .update(schema.nwaveRunWaves)
-      .set({ status: "HALTED", ended_at: now })
-      .where(eq(schema.nwaveRunWaves.id, activeWave.id))
-      .run();
-  }
-}
+function haltActiveWaves(orm: OrgOpsDrizzleDb, activeWaves: NwaveRunWaveRow[], now: number): void {}
 
 /**

[NoCoverage] BlockStatement
api/src/routes/nwave-runs.ts:190:41
 }
 
 function haltActiveWaves(orm: OrgOpsDrizzleDb, activeWaves: NwaveRunWaveRow[], now: number): void {
-  for (const activeWave of activeWaves) {
-    stopTrackedProcess(orm, activeWave.process_id);
-    orm
-      .update(schema.nwaveRunWaves)
-      .set({ status: "HALTED", ended_at: now })
-      .where(eq(schema.nwaveRunWaves.id, activeWave.id))
-      .run();
-  }
+  for (const activeWave of activeWaves) {}
 }
 

[NoCoverage] BlockStatement
api/src/routes/nwave-runs.ts:207:88
  * means a run that *was* underway got stopped). This is the only halt call site the Wave Runner
  * uses on a shellStart spawn failure.
  */
-function determineHaltedRunStatus(existingRun: NwaveRunRow): "START_FAILED" | "HALTED" {
-  return existingRun.status === "STARTING" ? "START_FAILED" : "HALTED";
-}
+function determineHaltedRunStatus(existingRun: NwaveRunRow): "START_FAILED" | "HALTED" {}
 
 /**

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:208:10
  * uses on a shellStart spawn failure.
  */
 function determineHaltedRunStatus(existingRun: NwaveRunRow): "START_FAILED" | "HALTED" {
-  return existingRun.status === "STARTING" ? "START_FAILED" : "HALTED";
+  return false ? "START_FAILED" : "HALTED";
 }
 

[NoCoverage] EqualityOperator
api/src/routes/nwave-runs.ts:208:10
  * uses on a shellStart spawn failure.
  */
 function determineHaltedRunStatus(existingRun: NwaveRunRow): "START_FAILED" | "HALTED" {
-  return existingRun.status === "STARTING" ? "START_FAILED" : "HALTED";
+  return existingRun.status !== "STARTING" ? "START_FAILED" : "HALTED";
 }
 

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:230:9
   app.post("/api/nwave-runs", async (c) => {
     const body = await c.req.json();
     const ticketRef = requireNonEmptyTrimmedString(body.ticketRef);
-    if (!ticketRef) return jsonResponse(c, { error: "ticketRef is required" }, 400);
+    if (true) return jsonResponse(c, { error: "ticketRef is required" }, 400);
     const channelId = requireNonEmptyTrimmedString(body.channelId);
     if (!channelId) return jsonResponse(c, { error: "channelId is required" }, 400);

[NoCoverage] BooleanLiteral
api/src/routes/nwave-runs.ts:230:9
   app.post("/api/nwave-runs", async (c) => {
     const body = await c.req.json();
     const ticketRef = requireNonEmptyTrimmedString(body.ticketRef);
-    if (!ticketRef) return jsonResponse(c, { error: "ticketRef is required" }, 400);
+    if (ticketRef) return jsonResponse(c, { error: "ticketRef is required" }, 400);
     const channelId = requireNonEmptyTrimmedString(body.channelId);
     if (!channelId) return jsonResponse(c, { error: "channelId is required" }, 400);

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:232:9
     const ticketRef = requireNonEmptyTrimmedString(body.ticketRef);
     if (!ticketRef) return jsonResponse(c, { error: "ticketRef is required" }, 400);
     const channelId = requireNonEmptyTrimmedString(body.channelId);
-    if (!channelId) return jsonResponse(c, { error: "channelId is required" }, 400);
+    if (false) return jsonResponse(c, { error: "channelId is required" }, 400);
     const restatementText = requireNonEmptyTrimmedString(body.restatementText);
     if (!restatementText) {

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:232:9
     const ticketRef = requireNonEmptyTrimmedString(body.ticketRef);
     if (!ticketRef) return jsonResponse(c, { error: "ticketRef is required" }, 400);
     const channelId = requireNonEmptyTrimmedString(body.channelId);
-    if (!channelId) return jsonResponse(c, { error: "channelId is required" }, 400);
+    if (true) return jsonResponse(c, { error: "channelId is required" }, 400);
     const restatementText = requireNonEmptyTrimmedString(body.restatementText);
     if (!restatementText) {

[NoCoverage] BooleanLiteral
api/src/routes/nwave-runs.ts:234:9
     const channelId = requireNonEmptyTrimmedString(body.channelId);
     if (!channelId) return jsonResponse(c, { error: "channelId is required" }, 400);
     const restatementText = requireNonEmptyTrimmedString(body.restatementText);
-    if (!restatementText) {
+    if (restatementText) {
       return jsonResponse(c, { error: "restatementText must be a non-empty string" }, 400);
     }

[NoCoverage] BlockStatement
api/src/routes/nwave-runs.ts:234:27
     const channelId = requireNonEmptyTrimmedString(body.channelId);
     if (!channelId) return jsonResponse(c, { error: "channelId is required" }, 400);
     const restatementText = requireNonEmptyTrimmedString(body.restatementText);
-    if (!restatementText) {
-      return jsonResponse(c, { error: "restatementText must be a non-empty string" }, 400);
-    }
+    if (!restatementText) {}
 
     const id = generateRunId();

[NoCoverage] ObjectLiteral
api/src/routes/nwave-runs.ts:235:30
     if (!channelId) return jsonResponse(c, { error: "channelId is required" }, 400);
     const restatementText = requireNonEmptyTrimmedString(body.restatementText);
     if (!restatementText) {
-      return jsonResponse(c, { error: "restatementText must be a non-empty string" }, 400);
+      return jsonResponse(c, {}, 400);
     }
 

[NoCoverage] BlockStatement
api/src/routes/nwave-runs.ts:263:56
     return jsonResponse(c, toRunResponse(row), 201);
   });
 
-  app.post("/api/nwave-runs/:id/confirm", async (c) => {
-    const runId = c.req.param("id");
-    const existing = orm
-      .select()
-      .from(schema.nwaveRuns)
-      .where(eq(schema.nwaveRuns.id, runId))
-      .get() as NwaveRunRow | undefined;
-    if (!existing) return jsonResponse(c, { error: "Run not found" }, 404);
-
-    orm
-      .update(schema.nwaveRuns)
-      .set({ status: "STARTING", confirmed_at: Date.now() })
-      .where(eq(schema.nwaveRuns.id, runId))
-      .run();
-
-    const row = orm
-      .select()
-      .from(schema.nwaveRuns)
-      .where(eq(schema.nwaveRuns.id, runId))
-      .get() as NwaveRunRow;
-    return jsonResponse(c, toRunResponse(row), 200);
-  });
+  app.post("/api/nwave-runs/:id/confirm", async (c) => {});
 
   app.post("/api/nwave-runs/:id/waves", async (c) => {

[NoCoverage] StringLiteral
api/src/routes/nwave-runs.ts:264:31
   });
 
   app.post("/api/nwave-runs/:id/confirm", async (c) => {
-    const runId = c.req.param("id");
+    const runId = c.req.param("");
     const existing = orm
       .select()

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:270:9
       .from(schema.nwaveRuns)
       .where(eq(schema.nwaveRuns.id, runId))
       .get() as NwaveRunRow | undefined;
-    if (!existing) return jsonResponse(c, { error: "Run not found" }, 404);
+    if (false) return jsonResponse(c, { error: "Run not found" }, 404);
 
     orm

[NoCoverage] BooleanLiteral
api/src/routes/nwave-runs.ts:270:9
       .from(schema.nwaveRuns)
       .where(eq(schema.nwaveRuns.id, runId))
       .get() as NwaveRunRow | undefined;
-    if (!existing) return jsonResponse(c, { error: "Run not found" }, 404);
+    if (existing) return jsonResponse(c, { error: "Run not found" }, 404);
 
     orm

[NoCoverage] StringLiteral
api/src/routes/nwave-runs.ts:274:22
 
     orm
       .update(schema.nwaveRuns)
-      .set({ status: "STARTING", confirmed_at: Date.now() })
+      .set({ status: "", confirmed_at: Date.now() })
       .where(eq(schema.nwaveRuns.id, runId))
       .run();

[NoCoverage] ObjectLiteral
api/src/routes/nwave-runs.ts:274:12
 
     orm
       .update(schema.nwaveRuns)
-      .set({ status: "STARTING", confirmed_at: Date.now() })
+      .set({})
       .where(eq(schema.nwaveRuns.id, runId))
       .run();

[Survived] StringLiteral
api/src/routes/nwave-runs.ts:286:12
     return jsonResponse(c, toRunResponse(row), 200);
   });
 
-  app.post("/api/nwave-runs/:id/waves", async (c) => {
+  app.post("", async (c) => {
     const runId = c.req.param("id");
     const existingRun = orm

[NoCoverage] StringLiteral
api/src/routes/nwave-runs.ts:287:31
   });
 
   app.post("/api/nwave-runs/:id/waves", async (c) => {
-    const runId = c.req.param("id");
+    const runId = c.req.param("");
     const existingRun = orm
       .select()

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:293:9
       .from(schema.nwaveRuns)
       .where(eq(schema.nwaveRuns.id, runId))
       .get() as NwaveRunRow | undefined;
-    if (!existingRun) return jsonResponse(c, { error: "Run not found" }, 404);
+    if (true) return jsonResponse(c, { error: "Run not found" }, 404);
 
     const body = await c.req.json();

[NoCoverage] BooleanLiteral
api/src/routes/nwave-runs.ts:293:9
       .from(schema.nwaveRuns)
       .where(eq(schema.nwaveRuns.id, runId))
       .get() as NwaveRunRow | undefined;
-    if (!existingRun) return jsonResponse(c, { error: "Run not found" }, 404);
+    if (existingRun) return jsonResponse(c, { error: "Run not found" }, 404);
 
     const body = await c.req.json();

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:297:9
 
     const body = await c.req.json();
     const waveName = requireNonEmptyString(body.waveName);
-    if (!waveName) return jsonResponse(c, { error: "waveName is required" }, 400);
+    if (true) return jsonResponse(c, { error: "waveName is required" }, 400);
     const sequence = Number.isInteger(body.sequence) ? (body.sequence as number) : null;
     if (sequence === null) return jsonResponse(c, { error: "sequence is required" }, 400);

[NoCoverage] BooleanLiteral
api/src/routes/nwave-runs.ts:297:9
 
     const body = await c.req.json();
     const waveName = requireNonEmptyString(body.waveName);
-    if (!waveName) return jsonResponse(c, { error: "waveName is required" }, 400);
+    if (waveName) return jsonResponse(c, { error: "waveName is required" }, 400);
     const sequence = Number.isInteger(body.sequence) ? (body.sequence as number) : null;
     if (sequence === null) return jsonResponse(c, { error: "sequence is required" }, 400);

[NoCoverage] EqualityOperator
api/src/routes/nwave-runs.ts:299:9
     const waveName = requireNonEmptyString(body.waveName);
     if (!waveName) return jsonResponse(c, { error: "waveName is required" }, 400);
     const sequence = Number.isInteger(body.sequence) ? (body.sequence as number) : null;
-    if (sequence === null) return jsonResponse(c, { error: "sequence is required" }, 400);
+    if (sequence !== null) return jsonResponse(c, { error: "sequence is required" }, 400);
     const processId = requireNonEmptyString(body.processId);
     if (!processId) return jsonResponse(c, { error: "processId is required" }, 400);

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:299:9
     const waveName = requireNonEmptyString(body.waveName);
     if (!waveName) return jsonResponse(c, { error: "waveName is required" }, 400);
     const sequence = Number.isInteger(body.sequence) ? (body.sequence as number) : null;
-    if (sequence === null) return jsonResponse(c, { error: "sequence is required" }, 400);
+    if (true) return jsonResponse(c, { error: "sequence is required" }, 400);
     const processId = requireNonEmptyString(body.processId);
     if (!processId) return jsonResponse(c, { error: "processId is required" }, 400);

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:301:9
     const sequence = Number.isInteger(body.sequence) ? (body.sequence as number) : null;
     if (sequence === null) return jsonResponse(c, { error: "sequence is required" }, 400);
     const processId = requireNonEmptyString(body.processId);
-    if (!processId) return jsonResponse(c, { error: "processId is required" }, 400);
+    if (true) return jsonResponse(c, { error: "processId is required" }, 400);
 
     const waveId = randomUUID();

[NoCoverage] BooleanLiteral
api/src/routes/nwave-runs.ts:301:9
     const sequence = Number.isInteger(body.sequence) ? (body.sequence as number) : null;
     if (sequence === null) return jsonResponse(c, { error: "sequence is required" }, 400);
     const processId = requireNonEmptyString(body.processId);
-    if (!processId) return jsonResponse(c, { error: "processId is required" }, 400);
+    if (processId) return jsonResponse(c, { error: "processId is required" }, 400);
 
     const waveId = randomUUID();

[NoCoverage] ObjectLiteral
api/src/routes/nwave-runs.ts:307:15
     const now = Date.now();
     orm
       .insert(schema.nwaveRunWaves)
-      .values({
-        id: waveId,
-        run_id: runId,
-        wave_name: waveName,
-        sequence,
-        process_id: processId,
-        status: "RUNNING",
-        started_at: now,
-        ended_at: null,
-        exit_code: null,
-      })
+      .values({})
       .run();
 

[NoCoverage] LogicalOperator
api/src/routes/nwave-runs.ts:325:21
       .set({
         status: "RUNNING",
         current_wave: waveName,
-        started_at: existingRun.started_at ?? now,
+        started_at: existingRun.started_at && now,
       })
       .where(eq(schema.nwaveRuns.id, runId))

[Survived] StringLiteral
api/src/routes/nwave-runs.ts:338:12
     return jsonResponse(c, toWaveResponse(row), 201);
   });
 
-  app.post("/api/nwave-runs/:id/waves/:waveId/complete", async (c) => {
+  app.post("", async (c) => {
     const runId = c.req.param("id");
     const waveId = c.req.param("waveId");

[NoCoverage] StringLiteral
api/src/routes/nwave-runs.ts:339:31
   });
 
   app.post("/api/nwave-runs/:id/waves/:waveId/complete", async (c) => {
-    const runId = c.req.param("id");
+    const runId = c.req.param("");
     const waveId = c.req.param("waveId");
 

[NoCoverage] StringLiteral
api/src/routes/nwave-runs.ts:340:32
 
   app.post("/api/nwave-runs/:id/waves/:waveId/complete", async (c) => {
     const runId = c.req.param("id");
-    const waveId = c.req.param("waveId");
+    const waveId = c.req.param("");
 
     const existingRun = orm

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:347:9
       .from(schema.nwaveRuns)
       .where(eq(schema.nwaveRuns.id, runId))
       .get() as NwaveRunRow | undefined;
-    if (!existingRun) return jsonResponse(c, { error: "Run not found" }, 404);
+    if (false) return jsonResponse(c, { error: "Run not found" }, 404);
 
     const existingWave = orm

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:354:26
       .from(schema.nwaveRunWaves)
       .where(eq(schema.nwaveRunWaves.id, waveId))
       .get() as NwaveRunWaveRow | undefined;
-    if (!existingWave || existingWave.run_id !== runId) {
+    if (!existingWave || false) {
       return jsonResponse(c, { error: "Wave not found" }, 404);
     }

[NoCoverage] BooleanLiteral
api/src/routes/nwave-runs.ts:354:9
       .from(schema.nwaveRunWaves)
       .where(eq(schema.nwaveRunWaves.id, waveId))
       .get() as NwaveRunWaveRow | undefined;
-    if (!existingWave || existingWave.run_id !== runId) {
+    if (existingWave || existingWave.run_id !== runId) {
       return jsonResponse(c, { error: "Wave not found" }, 404);
     }

[NoCoverage] ObjectLiteral
api/src/routes/nwave-runs.ts:355:30
       .where(eq(schema.nwaveRunWaves.id, waveId))
       .get() as NwaveRunWaveRow | undefined;
     if (!existingWave || existingWave.run_id !== runId) {
-      return jsonResponse(c, { error: "Wave not found" }, 404);
+      return jsonResponse(c, {}, 404);
     }
 
