[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:361:9
     // Idempotency guard (US-04 AC5, at-least-once redelivery): a wave already recorded as
     // COMPLETED/FAILED/HALTED is a no-op — keyed off the wave's own recorded status, never a
     // separate dedup table. The run is never advanced a second time for the same wave.
-    if (existingWave.status !== "RUNNING") {
+    if (false) {
       return jsonResponse(c, toWaveResponse(existingWave), 200);
     }

[NoCoverage] EqualityOperator
api/src/routes/nwave-runs.ts:361:9
     // Idempotency guard (US-04 AC5, at-least-once redelivery): a wave already recorded as
     // COMPLETED/FAILED/HALTED is a no-op — keyed off the wave's own recorded status, never a
     // separate dedup table. The run is never advanced a second time for the same wave.
-    if (existingWave.status !== "RUNNING") {
+    if (existingWave.status === "RUNNING") {
       return jsonResponse(c, toWaveResponse(existingWave), 200);
     }

[NoCoverage] EqualityOperator
api/src/routes/nwave-runs.ts:367:9
 
     const body = await c.req.json();
     const exitCode = Number.isInteger(body.exitCode) ? (body.exitCode as number) : null;
-    if (exitCode === null) return jsonResponse(c, { error: "exitCode is required" }, 400);
+    if (exitCode !== null) return jsonResponse(c, { error: "exitCode is required" }, 400);
     const failureReason = typeof body.failureReason === "string" ? body.failureReason : null;
 

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:367:9
 
     const body = await c.req.json();
     const exitCode = Number.isInteger(body.exitCode) ? (body.exitCode as number) : null;
-    if (exitCode === null) return jsonResponse(c, { error: "exitCode is required" }, 400);
+    if (true) return jsonResponse(c, { error: "exitCode is required" }, 400);
     const failureReason = typeof body.failureReason === "string" ? body.failureReason : null;
 

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:368:27
     const body = await c.req.json();
     const exitCode = Number.isInteger(body.exitCode) ? (body.exitCode as number) : null;
     if (exitCode === null) return jsonResponse(c, { error: "exitCode is required" }, 400);
-    const failureReason = typeof body.failureReason === "string" ? body.failureReason : null;
+    const failureReason = false ? body.failureReason : null;
 
     const now = Date.now();

[NoCoverage] EqualityOperator
api/src/routes/nwave-runs.ts:368:27
     const body = await c.req.json();
     const exitCode = Number.isInteger(body.exitCode) ? (body.exitCode as number) : null;
     if (exitCode === null) return jsonResponse(c, { error: "exitCode is required" }, 400);
-    const failureReason = typeof body.failureReason === "string" ? body.failureReason : null;
+    const failureReason = typeof body.failureReason !== "string" ? body.failureReason : null;
 
     const now = Date.now();

[NoCoverage] BlockStatement
api/src/routes/nwave-runs.ts:379:31
       .where(eq(schema.nwaveRunWaves.id, waveId))
       .run();
 
-    if (outcome === "FAILED") {
-      applyFailedRunTransition(orm, {
-        runId,
-        waveName: existingWave.wave_name,
-        exitCode,
-        failureReason,
-        now,
-      });
-    } else {
+    if (outcome === "FAILED") {} else {
       applyCompletedRunTransition(orm, { runId, waveName: existingWave.wave_name, now });
     }

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:379:9
       .where(eq(schema.nwaveRunWaves.id, waveId))
       .run();
 
-    if (outcome === "FAILED") {
+    if (false) {
       applyFailedRunTransition(orm, {
         runId,

[NoCoverage] BlockStatement
api/src/routes/nwave-runs.ts:387:12
         failureReason,
         now,
       });
-    } else {
-      applyCompletedRunTransition(orm, { runId, waveName: existingWave.wave_name, now });
-    }
+    } else {}
 
     const updatedWave = orm

[NoCoverage] ArrowFunction
api/src/routes/nwave-runs.ts:408:43
       .get() as NwaveRunRow | undefined;
     if (!existingRun) return jsonResponse(c, { error: "Run not found" }, 404);
 
-    const body = await c.req.json().catch(() => ({}) as Record<string, unknown>);
+    const body = await c.req.json().catch(() => undefined);
     const reason = typeof body.reason === "string" ? body.reason : null;
 

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:409:20
     if (!existingRun) return jsonResponse(c, { error: "Run not found" }, 404);
 
     const body = await c.req.json().catch(() => ({}) as Record<string, unknown>);
-    const reason = typeof body.reason === "string" ? body.reason : null;
+    const reason = true ? body.reason : null;
 
     const activeWaves = orm

[NoCoverage] EqualityOperator
api/src/routes/nwave-runs.ts:409:20
     if (!existingRun) return jsonResponse(c, { error: "Run not found" }, 404);
 
     const body = await c.req.json().catch(() => ({}) as Record<string, unknown>);
-    const reason = typeof body.reason === "string" ? body.reason : null;
+    const reason = typeof body.reason !== "string" ? body.reason : null;
 
     const activeWaves = orm

[NoCoverage] LogicalOperator
api/src/routes/nwave-runs.ts:430:25
         status: terminalStatus,
         ended_at: now,
         current_wave: null,
-        failure_reason: reason ?? existingRun.failure_reason,
+        failure_reason: reason && existingRun.failure_reason,
       })
       .where(eq(schema.nwaveRuns.id, runId))

[NoCoverage] BlockStatement
api/src/routes/nwave-runs.ts:443:47
     return jsonResponse(c, toRunResponse(updatedRun), 200);
   });
 
-  app.get("/api/nwave-runs/:id", async (c) => {
-    const runId = c.req.param("id");
-    const runRow = orm
-      .select()
-      .from(schema.nwaveRuns)
-      .where(eq(schema.nwaveRuns.id, runId))
-      .get() as NwaveRunRow | undefined;
-    if (!runRow) return jsonResponse(c, { error: "Run not found" }, 404);
-
-    const waveRows = orm
-      .select()
-      .from(schema.nwaveRunWaves)
-      .where(eq(schema.nwaveRunWaves.run_id, runId))
-      .orderBy(asc(schema.nwaveRunWaves.sequence))
-      .all() as NwaveRunWaveRow[];
-
-    return jsonResponse(c, {
-      ...toRunResponse(runRow),
-      waves: waveRows.map(toWaveResponse),
-    });
-  });
+  app.get("/api/nwave-runs/:id", async (c) => {});
 
   app.post(

[Survived] StringLiteral
api/src/routes/nwave-runs.ts:443:11
     return jsonResponse(c, toRunResponse(updatedRun), 200);
   });
 
-  app.get("/api/nwave-runs/:id", async (c) => {
+  app.get("", async (c) => {
     const runId = c.req.param("id");
     const runRow = orm

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:450:9
       .from(schema.nwaveRuns)
       .where(eq(schema.nwaveRuns.id, runId))
       .get() as NwaveRunRow | undefined;
-    if (!runRow) return jsonResponse(c, { error: "Run not found" }, 404);
+    if (false) return jsonResponse(c, { error: "Run not found" }, 404);
 
     const waveRows = orm

[NoCoverage] ConditionalExpression
api/src/routes/nwave-runs.ts:450:9
       .from(schema.nwaveRuns)
       .where(eq(schema.nwaveRuns.id, runId))
       .get() as NwaveRunRow | undefined;
-    if (!runRow) return jsonResponse(c, { error: "Run not found" }, 404);
+    if (true) return jsonResponse(c, { error: "Run not found" }, 404);
 
     const waveRows = orm

[NoCoverage] ObjectLiteral
api/src/routes/nwave-runs.ts:459:28
       .orderBy(asc(schema.nwaveRunWaves.sequence))
       .all() as NwaveRunWaveRow[];
 
-    return jsonResponse(c, {
-      ...toRunResponse(runRow),
-      waves: waveRows.map(toWaveResponse),
-    });
+    return jsonResponse(c, {});
   });
 

[Survived] StringLiteral
api/src/routes/nwave-runs.ts:478:9
     notImplemented(
       "POST /api/nwave-runs/:id/completion-summary/request-changes — valid when " +
         "approval_status is PENDING or GOVERNANCE_HOLD; always calls createFollowOnRun with " +
-        "cycleReason=CHANGES_REQUESTED, never RETRY (US-12 AC3, ADR-0011)",
+        "",
     ),
   );

[Survived] StringLiteral
api/src/routes/nwave-runs.ts:491:5
   );
 
   app.post(
-    "/api/nwave-runs/:id/retry",
+    "",
     notImplemented(
       "POST /api/nwave-runs/:id/retry — only valid when retry_available=true on the run's " +

[Survived] StringLiteral
api/src/routes/nwave-runs.ts:493:7
   app.post(
     "/api/nwave-runs/:id/retry",
     notImplemented(
-      "POST /api/nwave-runs/:id/retry — only valid when retry_available=true on the run's " +
+      "" +
         "completion row (US-13 AC5)",
     ),

[Survived] StringLiteral
api/src/routes/nwave-runs.ts:502:9
     "/api/nwave-runs/:id/escalate",
     notImplemented(
       "POST /api/nwave-runs/:id/escalate — sets tickets.resolution_status=ESCALATED and " +
-        "nwave_runs.escalated_at, posts to the governance team with cycle-history context " +
+        "" +
         "(US-13 AC5)",
     ),

[Survived] StringLiteral
api/src/routes/nwave-runs.ts:503:9
     notImplemented(
       "POST /api/nwave-runs/:id/escalate — sets tickets.resolution_status=ESCALATED and " +
         "nwave_runs.escalated_at, posts to the governance team with cycle-history context " +
-        "(US-13 AC5)",
+        "",
     ),
   );

[Survived] StringLiteral
api/src/routes/nwave-runs.ts:515:5
   );
 
   app.get(
-    "/api/nwave-runs/:id/cycle-history",
+    "",
     notImplemented(
       "GET /api/nwave-runs/:id/cycle-history — walks the previous_run_id chain backward, " +
