[Killed] BlockStatement
agent-runner/src/nwave-invocation/http-run-repository.ts:10:96
   apiFetch: ApiFetch;
 };
 
-async function postJson(apiFetch: ApiFetch, path: string, payload: unknown): Promise<Response> {
-  return apiFetch(path, {
-    method: "POST",
-    headers: { "content-type": "application/json" },
-    body: JSON.stringify(payload),
-  });
-}
+async function postJson(apiFetch: ApiFetch, path: string, payload: unknown): Promise<Response> {}
 
 async function parseJsonOrThrow<T>(response: Response, context: string): Promise<T> {
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@walking_skeleton @real-io @in-memory @driving_port @US-04] Maria confirms the system's understood intent and an nWave 
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] BlockStatement
agent-runner/src/nwave-invocation/http-run-repository.ts:18:85
   });
 }
 
-async function parseJsonOrThrow<T>(response: Response, context: string): Promise<T> {
-  if (!response.ok) {
-    const body = await response.text();
-    throw new Error(`${context} failed with status ${response.status}: ${body}`);
-  }
-  return (await response.json()) as T;
-}
+async function parseJsonOrThrow<T>(response: Response, context: string): Promise<T> {}
 
 /**
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@walking_skeleton @real-io @in-memory @driving_port @US-04] Maria confirms the system's understood intent and an nWave 
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
agent-runner/src/nwave-invocation/http-run-repository.ts:19:7
 }
 
 async function parseJsonOrThrow<T>(response: Response, context: string): Promise<T> {
-  if (!response.ok) {
+  if (true) {
     const body = await response.text();
     throw new Error(`${context} failed with status ${response.status}: ${body}`);
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@walking_skeleton @real-io @in-memory @driving_port @US-04] Maria confirms the system's understood intent and an nWave 

[Killed] ConditionalExpression
agent-runner/src/nwave-invocation/http-run-repository.ts:19:7
 }
 
 async function parseJsonOrThrow<T>(response: Response, context: string): Promise<T> {
-  if (!response.ok) {
+  if (false) {
     const body = await response.text();
     throw new Error(`${context} failed with status ${response.status}: ${body}`);
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] the repository surfaces the API's error status and body when a request is rejected, rather than silently return
statusReason: promise resolved "{ error: 'Run not found' }" instead of rejecting

[Killed] StringLiteral
agent-runner/src/nwave-invocation/http-run-repository.ts:21:21
 async function parseJsonOrThrow<T>(response: Response, context: string): Promise<T> {
   if (!response.ok) {
     const body = await response.text();
-    throw new Error(`${context} failed with status ${response.status}: ${body}`);
+    throw new Error(``);
   }
   return (await response.json()) as T;
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] the repository surfaces the API's error status and body when a request is rejected, rather than silently return
statusReason: expected [Function] to throw error matching /recordWaveStarted failed with status …/ but got ''

[Killed] BlockStatement
agent-runner/src/nwave-invocation/http-run-repository.ts:35:33
   const { apiFetch } = deps;
 
   return {
-    createRun: async (input) => {
-      const response = await postJson(apiFetch, "/api/nwave-runs", input);
-      return parseJsonOrThrow<NwaveRun>(response, "createRun");
-    },
+    createRun: async (input) => {},
 
     confirmRun: async (input) => {
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@walking_skeleton @real-io @in-memory @driving_port @US-04] Maria confirms the system's understood intent and an nWave 
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
agent-runner/src/nwave-invocation/http-run-repository.ts:40:34
       return parseJsonOrThrow<NwaveRun>(response, "createRun");
     },
 
-    confirmRun: async (input) => {
-      const response = await postJson(apiFetch, `/api/nwave-runs/${input.runId}/confirm`, {});
-      return parseJsonOrThrow<NwaveRun>(response, "confirmRun");
-    },
+    confirmRun: async (input) => {},
 
     recordWaveStarted: async (input) => {
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@walking_skeleton @real-io @in-memory @driving_port @US-04] Maria confirms the system's understood intent and an nWave 
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
agent-runner/src/nwave-invocation/http-run-repository.ts:41:49
     },
 
     confirmRun: async (input) => {
-      const response = await postJson(apiFetch, `/api/nwave-runs/${input.runId}/confirm`, {});
+      const response = await postJson(apiFetch, ``, {});
       return parseJsonOrThrow<NwaveRun>(response, "confirmRun");
     },
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@walking_skeleton @real-io @in-memory @driving_port @US-04] Maria confirms the system's understood intent and an nWave 
statusReason: confirmRun failed with status 404: 404 Not Found

[Killed] BlockStatement
agent-runner/src/nwave-invocation/http-run-repository.ts:45:41
       return parseJsonOrThrow<NwaveRun>(response, "confirmRun");
     },
 
-    recordWaveStarted: async (input) => {
-      const response = await postJson(apiFetch, `/api/nwave-runs/${input.runId}/waves`, {
-        waveName: input.waveName,
-        sequence: input.sequence,
-        processId: input.processId,
-      });
-      return parseJsonOrThrow<NwaveRunWave>(response, "recordWaveStarted");
-    },
+    recordWaveStarted: async (input) => {},
 
     recordWaveCompleted: async (input) => {
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@property @US-04] the run id remains stable and is referenced by every wave transition for the life of the run
statusReason: expected undefined to be 'RUN-208EC675' // Object.is equality

[Killed] ObjectLiteral
agent-runner/src/nwave-invocation/http-run-repository.ts:46:89
     },
 
     recordWaveStarted: async (input) => {
-      const response = await postJson(apiFetch, `/api/nwave-runs/${input.runId}/waves`, {
-        waveName: input.waveName,
-        sequence: input.sequence,
-        processId: input.processId,
-      });
+      const response = await postJson(apiFetch, `/api/nwave-runs/${input.runId}/waves`, {});
       return parseJsonOrThrow<NwaveRunWave>(response, "recordWaveStarted");
     },
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@walking_skeleton @real-io @in-memory @driving_port @US-04] Maria confirms the system's understood intent and an nWave 
statusReason: recordWaveStarted failed with status 400: {"error":"waveName is required"}

[Killed] StringLiteral
agent-runner/src/nwave-invocation/http-run-repository.ts:51:55
         sequence: input.sequence,
         processId: input.processId,
       });
-      return parseJsonOrThrow<NwaveRunWave>(response, "recordWaveStarted");
+      return parseJsonOrThrow<NwaveRunWave>(response, "");
     },
 
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] the repository surfaces the API's error status and body when a request is rejected, rather than silently return
statusReason: expected [Function] to throw error matching /recordWaveStarted failed with status …/ but got ' failed with status 404: {"error":"Ru…'

[Killed] BlockStatement
agent-runner/src/nwave-invocation/http-run-repository.ts:54:43
       return parseJsonOrThrow<NwaveRunWave>(response, "recordWaveStarted");
     },
 
-    recordWaveCompleted: async (input) => {
-      const response = await postJson(
-        apiFetch,
-        `/api/nwave-runs/${input.runId}/waves/${input.waveId}/complete`,
-        { exitCode: input.exitCode },
-      );
-      return parseJsonOrThrow<NwaveRunWave>(response, "recordWaveCompleted");
-    },
+    recordWaveCompleted: async (input) => {},
 
     recordWaveFailed: async (input) => {
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] wave chaining follows DISCUSS, DESIGN, DISTILL, DELIVER in order, and the run completes once DELIVER exits clea
statusReason: expected 'RUNNING' to be 'COMPLETED' // Object.is equality

[Killed] StringLiteral
agent-runner/src/nwave-invocation/http-run-repository.ts:57:9
     recordWaveCompleted: async (input) => {
       const response = await postJson(
         apiFetch,
-        `/api/nwave-runs/${input.runId}/waves/${input.waveId}/complete`,
+        ``,
         { exitCode: input.exitCode },
       );
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@property @US-04] the run id remains stable and is referenced by every wave transition for the life of the run
statusReason: recordWaveCompleted failed with status 404: 404 Not Found

[Survived] StringLiteral
agent-runner/src/nwave-invocation/http-run-repository.ts:60:55
         `/api/nwave-runs/${input.runId}/waves/${input.waveId}/complete`,
         { exitCode: input.exitCode },
       );
-      return parseJsonOrThrow<NwaveRunWave>(response, "recordWaveCompleted");
+      return parseJsonOrThrow<NwaveRunWave>(response, "");
     },
 

[Killed] BlockStatement
agent-runner/src/nwave-invocation/http-run-repository.ts:63:40
       return parseJsonOrThrow<NwaveRunWave>(response, "recordWaveCompleted");
     },
 
-    recordWaveFailed: async (input) => {
-      const response = await postJson(
-        apiFetch,
-        `/api/nwave-runs/${input.runId}/waves/${input.waveId}/complete`,
-        { exitCode: input.exitCode, failureReason: input.failureReason },
-      );
-      return parseJsonOrThrow<NwaveRunWave>(response, "recordWaveFailed");
-    },
+    recordWaveFailed: async (input) => {},
 
     haltRun: async (input) => {
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a wave that exits with a non-zero code fails the run and halts the chain without starting the next wave
statusReason: expected 'RUNNING' to be 'FAILED' // Object.is equality

[Survived] StringLiteral
agent-runner/src/nwave-invocation/http-run-repository.ts:69:55
         `/api/nwave-runs/${input.runId}/waves/${input.waveId}/complete`,
         { exitCode: input.exitCode, failureReason: input.failureReason },
       );
-      return parseJsonOrThrow<NwaveRunWave>(response, "recordWaveFailed");
+      return parseJsonOrThrow<NwaveRunWave>(response, "");
     },
 

[Killed] BlockStatement
agent-runner/src/nwave-invocation/http-run-repository.ts:72:31
       return parseJsonOrThrow<NwaveRunWave>(response, "recordWaveFailed");
     },
 
-    haltRun: async (input) => {
-      const response = await postJson(apiFetch, `/api/nwave-runs/${input.runId}/halt`, {
-        reason: input.reason,
-      });
-      return parseJsonOrThrow<NwaveRun>(response, "haltRun");
-    },
+    haltRun: async (input) => {},
 
     getRun: async (input) => {
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] Maria is told clearly a run could not start when the execution environment is unavailable, never shown false pr
statusReason: Cannot read properties of undefined (reading 'status')

[Survived] StringLiteral
agent-runner/src/nwave-invocation/http-run-repository.ts:76:51
       const response = await postJson(apiFetch, `/api/nwave-runs/${input.runId}/halt`, {
         reason: input.reason,
       });
-      return parseJsonOrThrow<NwaveRun>(response, "haltRun");
+      return parseJsonOrThrow<NwaveRun>(response, "");
     },
 

[Killed] BlockStatement
agent-runner/src/nwave-invocation/http-run-repository.ts:79:30
       return parseJsonOrThrow<NwaveRun>(response, "haltRun");
     },
 
-    getRun: async (input) => {
-      const response = await apiFetch(`/api/nwave-runs/${input.runId}`);
-      if (response.status === 404) return null;
-      return parseJsonOrThrow<NwaveRun & { waves: NwaveRunWave[] }>(response, "getRun");
-    },
+    getRun: async (input) => {},
   };
 }
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@property @US-04] the run id remains stable and is referenced by every wave transition for the life of the run
statusReason: expected undefined to be 'RUN-82039311' // Object.is equality

[Killed] ConditionalExpression
agent-runner/src/nwave-invocation/http-run-repository.ts:81:11
 
     getRun: async (input) => {
       const response = await apiFetch(`/api/nwave-runs/${input.runId}`);
-      if (response.status === 404) return null;
+      if (false) return null;
       return parseJsonOrThrow<NwaveRun & { waves: NwaveRunWave[] }>(response, "getRun");
     },
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a wave-completion notification for a run that does not exist, or that names a wave which is not currently runni
statusReason: getRun failed with status 404: {"error":"Run not found"}

[Killed] ConditionalExpression
agent-runner/src/nwave-invocation/http-run-repository.ts:81:11
 
     getRun: async (input) => {
       const response = await apiFetch(`/api/nwave-runs/${input.runId}`);
-      if (response.status === 404) return null;
+      if (true) return null;
       return parseJsonOrThrow<NwaveRun & { waves: NwaveRunWave[] }>(response, "getRun");
     },
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@property @US-04] the run id remains stable and is referenced by every wave transition for the life of the run
statusReason: expected undefined to be 'RUN-F482AC76' // Object.is equality

[Survived] StringLiteral
agent-runner/src/nwave-invocation/http-run-repository.ts:82:79
     getRun: async (input) => {
       const response = await apiFetch(`/api/nwave-runs/${input.runId}`);
       if (response.status === 404) return null;
-      return parseJsonOrThrow<NwaveRun & { waves: NwaveRunWave[] }>(response, "getRun");
+      return parseJsonOrThrow<NwaveRun & { waves: NwaveRunWave[] }>(response, "");
     },
   };
