[Killed] StringLiteral
agent-runner/src/nwave-invocation/restatement-composer.ts:26:3
 };
 
 const RESTATEMENT_SYSTEM_PROMPT =
-  "You restate a support ticket's intent in one or two plain-language sentences, for the " +
+  "" +
   "ticket submitter to confirm or correct before any implementation work starts. State only " +
   "what the ticket asks for — no questions, no commentary, no implementation detail.";
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] the composed prompt instructs the model to restate for confirm-or-correct without adding commentary, carries th
statusReason: expected 'ticket submitter to confirm or correc…' to contain 'restate'

[Killed] StringLiteral
agent-runner/src/nwave-invocation/restatement-composer.ts:28:3
 const RESTATEMENT_SYSTEM_PROMPT =
   "You restate a support ticket's intent in one or two plain-language sentences, for the " +
   "ticket submitter to confirm or correct before any implementation work starts. State only " +
-  "what the ticket asks for — no questions, no commentary, no implementation detail.";
+  "";
 
 function buildRestatementUserPrompt(input: TicketIntentInput): string {
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] the composed prompt instructs the model to restate for confirm-or-correct without adding commentary, carries th
statusReason: expected 'You restate a support ticket\'s inten…' to contain 'no implementation detail'

[Killed] BlockStatement
agent-runner/src/nwave-invocation/restatement-composer.ts:30:71
   "ticket submitter to confirm or correct before any implementation work starts. State only " +
   "what the ticket asks for — no questions, no commentary, no implementation detail.";
 
-function buildRestatementUserPrompt(input: TicketIntentInput): string {
-  return `Ticket ${input.ticketRef}: "${input.ticketTitle}"\n\n${input.ticketDescription}`;
-}
+function buildRestatementUserPrompt(input: TicketIntentInput): string {}
 
 /**
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] the composed prompt instructs the model to restate for confirm-or-correct without adding commentary, carries th
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
agent-runner/src/nwave-invocation/restatement-composer.ts:42:41
 export async function composeRestatement(
   input: TicketIntentInput,
   deps: RestatementComposerDependencies,
-): Promise<{ restatementText: string }> {
-  const generated = await deps.generate(deps.modelId, [
-    { role: "system", content: RESTATEMENT_SYSTEM_PROMPT },
-    { role: "user", content: buildRestatementUserPrompt(input) },
-  ]);
-  return { restatementText: generated.text.trim() };
-}
+): Promise<{ restatementText: string }> {}
 
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@walking_skeleton @real-io @in-memory @driving_port @US-04] Maria confirms the system's understood intent and an nWave 
statusReason: Cannot destructure property 'restatementText' of '(intermediate value)' as it is undefined.

[Killed] ObjectLiteral
agent-runner/src/nwave-invocation/restatement-composer.ts:45:5
 ): Promise<{ restatementText: string }> {
   const generated = await deps.generate(deps.modelId, [
     { role: "system", content: RESTATEMENT_SYSTEM_PROMPT },
-    { role: "user", content: buildRestatementUserPrompt(input) },
+    {},
   ]);
   return { restatementText: generated.text.trim() };
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] the composed prompt instructs the model to restate for confirm-or-correct without adding commentary, carries th
statusReason: expected undefined to be 'user' // Object.is equality

[Killed] MethodExpression
agent-runner/src/nwave-invocation/restatement-composer.ts:47:29
     { role: "system", content: RESTATEMENT_SYSTEM_PROMPT },
     { role: "user", content: buildRestatementUserPrompt(input) },
   ]);
-  return { restatementText: generated.text.trim() };
+  return { restatementText: generated.text };
 }
 
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] the composed prompt instructs the model to restate for confirm-or-correct without adding commentary, carries th
statusReason: expected '  Adds a region filter to the Reports…' to be 'Adds a region filter to the Reports d…' // Object.is equality

[Killed] ObjectLiteral
agent-runner/src/nwave-invocation/restatement-composer.ts:47:10
     { role: "system", content: RESTATEMENT_SYSTEM_PROMPT },
     { role: "user", content: buildRestatementUserPrompt(input) },
   ]);
-  return { restatementText: generated.text.trim() };
+  return {};
 }
 
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@walking_skeleton @real-io @in-memory @driving_port @US-04] Maria confirms the system's understood intent and an nWave 
statusReason: expected '' to be undefined // Object.is equality
