[Killed] BlockStatement
agent-runner/src/nwave-invocation/run-watchdog.ts:17:88
   waveName: WaveName;
 };
 
-function isWaveStale(wave: WatchedWave, nowMs: number, idleTimeoutMs: number): boolean {
-  if (wave.status !== "RUNNING") return false;
-  if (wave.lastOutputAt === null) return false;
-  return nowMs - wave.lastOutputAt > idleTimeoutMs;
-}
+function isWaveStale(wave: WatchedWave, nowMs: number, idleTimeoutMs: number): boolean {}
 
 function toStaleWaveFlag(wave: WatchedWave): StaleWaveFlag {
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a wave that produces no output for longer than the configured threshold is halted with a clear "no progress" si
statusReason: expected [] to deeply equal [ { runId: 'RUN-8841', …(2) } ]

[Killed] EqualityOperator
agent-runner/src/nwave-invocation/run-watchdog.ts:18:7
 };
 
 function isWaveStale(wave: WatchedWave, nowMs: number, idleTimeoutMs: number): boolean {
-  if (wave.status !== "RUNNING") return false;
+  if (wave.status === "RUNNING") return false;
   if (wave.lastOutputAt === null) return false;
   return nowMs - wave.lastOutputAt > idleTimeoutMs;
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a wave that produces no output for longer than the configured threshold is halted with a clear "no progress" si
statusReason: expected [] to deeply equal [ { runId: 'RUN-8841', …(2) } ]

[Killed] BooleanLiteral
agent-runner/src/nwave-invocation/run-watchdog.ts:18:41
 };
 
 function isWaveStale(wave: WatchedWave, nowMs: number, idleTimeoutMs: number): boolean {
-  if (wave.status !== "RUNNING") return false;
+  if (wave.status !== "RUNNING") return true;
   if (wave.lastOutputAt === null) return false;
   return nowMs - wave.lastOutputAt > idleTimeoutMs;
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] only RUNNING waves that have exceeded the idle timeout are flagged stale — waves that are not running, have not
statusReason: expected [ { runId: 'RUN-8841', …(2) }, …(1) ] to deeply equal [ { runId: 'RUN-8841', …(2) } ]

[Killed] BooleanLiteral
agent-runner/src/nwave-invocation/run-watchdog.ts:19:42
 
 function isWaveStale(wave: WatchedWave, nowMs: number, idleTimeoutMs: number): boolean {
   if (wave.status !== "RUNNING") return false;
-  if (wave.lastOutputAt === null) return false;
+  if (wave.lastOutputAt === null) return true;
   return nowMs - wave.lastOutputAt > idleTimeoutMs;
 }
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] only RUNNING waves that have exceeded the idle timeout are flagged stale — waves that are not running, have not
statusReason: expected [ { runId: 'RUN-8841', …(2) }, …(1) ] to deeply equal [ { runId: 'RUN-8841', …(2) } ]

[Killed] ConditionalExpression
agent-runner/src/nwave-invocation/run-watchdog.ts:19:7
 
 function isWaveStale(wave: WatchedWave, nowMs: number, idleTimeoutMs: number): boolean {
   if (wave.status !== "RUNNING") return false;
-  if (wave.lastOutputAt === null) return false;
+  if (true) return false;
   return nowMs - wave.lastOutputAt > idleTimeoutMs;
 }
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a wave that produces no output for longer than the configured threshold is halted with a clear "no progress" si
statusReason: expected [] to deeply equal [ { runId: 'RUN-8841', …(2) } ]

[Killed] EqualityOperator
agent-runner/src/nwave-invocation/run-watchdog.ts:20:10
 function isWaveStale(wave: WatchedWave, nowMs: number, idleTimeoutMs: number): boolean {
   if (wave.status !== "RUNNING") return false;
   if (wave.lastOutputAt === null) return false;
-  return nowMs - wave.lastOutputAt > idleTimeoutMs;
+  return nowMs - wave.lastOutputAt >= idleTimeoutMs;
 }
 
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] only RUNNING waves that have exceeded the idle timeout are flagged stale — waves that are not running, have not
statusReason: expected [ { runId: 'RUN-8841', …(2) }, …(1) ] to deeply equal [ { runId: 'RUN-8841', …(2) } ]

[Killed] ArithmeticOperator
agent-runner/src/nwave-invocation/run-watchdog.ts:20:10
 function isWaveStale(wave: WatchedWave, nowMs: number, idleTimeoutMs: number): boolean {
   if (wave.status !== "RUNNING") return false;
   if (wave.lastOutputAt === null) return false;
-  return nowMs - wave.lastOutputAt > idleTimeoutMs;
+  return nowMs + wave.lastOutputAt > idleTimeoutMs;
 }
 
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] only RUNNING waves that have exceeded the idle timeout are flagged stale — waves that are not running, have not
statusReason: expected [ { runId: 'RUN-8841', …(2) }, …(2) ] to deeply equal [ { runId: 'RUN-8841', …(2) } ]

[Killed] BlockStatement
agent-runner/src/nwave-invocation/run-watchdog.ts:23:60
   return nowMs - wave.lastOutputAt > idleTimeoutMs;
 }
 
-function toStaleWaveFlag(wave: WatchedWave): StaleWaveFlag {
-  return { runId: wave.runId, waveId: wave.waveId, waveName: wave.waveName };
-}
+function toStaleWaveFlag(wave: WatchedWave): StaleWaveFlag {}
 
 /**
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a wave that produces no output for longer than the configured threshold is halted with a clear "no progress" si
statusReason: expected [ undefined ] to deeply equal [ { runId: 'RUN-8841', …(2) } ]

[Killed] BlockStatement
agent-runner/src/nwave-invocation/run-watchdog.ts:42:21
   waves: WatchedWave[];
   nowMs: number;
   idleTimeoutMs: number;
-}): StaleWaveFlag[] {
-  return input.waves
-    .filter((wave) => isWaveStale(wave, input.nowMs, input.idleTimeoutMs))
-    .map(toStaleWaveFlag);
-}
+}): StaleWaveFlag[] {}
 
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a wave that produces no output for longer than the configured threshold is halted with a clear "no progress" si
statusReason: expected undefined to deeply equal [ { runId: 'RUN-8841', …(2) } ]

[Killed] MethodExpression
agent-runner/src/nwave-invocation/run-watchdog.ts:43:10
   nowMs: number;
   idleTimeoutMs: number;
 }): StaleWaveFlag[] {
-  return input.waves
-    .filter((wave) => isWaveStale(wave, input.nowMs, input.idleTimeoutMs))
+  return input.waves
     .map(toStaleWaveFlag);
 }
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] only RUNNING waves that have exceeded the idle timeout are flagged stale — waves that are not running, have not
statusReason: expected [ { runId: 'RUN-8841', …(2) }, …(4) ] to deeply equal [ { runId: 'RUN-8841', …(2) } ]

[Killed] ArrowFunction
agent-runner/src/nwave-invocation/run-watchdog.ts:44:13
   idleTimeoutMs: number;
 }): StaleWaveFlag[] {
   return input.waves
-    .filter((wave) => isWaveStale(wave, input.nowMs, input.idleTimeoutMs))
+    .filter(() => undefined)
     .map(toStaleWaveFlag);
 }
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a wave that produces no output for longer than the configured threshold is halted with a clear "no progress" si
statusReason: expected [] to deeply equal [ { runId: 'RUN-8841', …(2) } ]
