[Killed] BlockStatement
agent-runner/src/nwave-invocation/wave-progress-translator.ts:15:98
   | { type: "nwave.run.wave_completed"; runId: string; waveName: WaveName }
   | { type: "nwave.run.wave_failed"; runId: string; waveName: WaveName; exitCode: number | null };
 
-function findWaveByProcessId(waves: NwaveRunWave[], processId: string): NwaveRunWave | undefined {
-  return waves.find((wave) => wave.processId === processId);
-}
+function findWaveByProcessId(waves: NwaveRunWave[], processId: string): NwaveRunWave | undefined {}
 
 function toWaveStartedEvent(wave: NwaveRunWave): WaveProgressDomainEvent {
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a run's wave-progress signal is derived from process lifecycle events, not from parsing agent output
statusReason: expected [] to deeply equal [ { …(3) }, { …(3) } ]

[Killed] EqualityOperator
agent-runner/src/nwave-invocation/wave-progress-translator.ts:16:31
   | { type: "nwave.run.wave_failed"; runId: string; waveName: WaveName; exitCode: number | null };
 
 function findWaveByProcessId(waves: NwaveRunWave[], processId: string): NwaveRunWave | undefined {
-  return waves.find((wave) => wave.processId === processId);
+  return waves.find((wave) => wave.processId !== processId);
 }
 
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a run's wave-progress signal is derived from process lifecycle events, not from parsing agent output
statusReason: expected [] to deeply equal [ { …(3) }, { …(3) } ]

[Killed] ConditionalExpression
agent-runner/src/nwave-invocation/wave-progress-translator.ts:16:31
   | { type: "nwave.run.wave_failed"; runId: string; waveName: WaveName; exitCode: number | null };
 
 function findWaveByProcessId(waves: NwaveRunWave[], processId: string): NwaveRunWave | undefined {
-  return waves.find((wave) => wave.processId === processId);
+  return waves.find((wave) => false);
 }
 
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a run's wave-progress signal is derived from process lifecycle events, not from parsing agent output
statusReason: expected [] to deeply equal [ { …(3) }, { …(3) } ]

[Killed] BlockStatement
agent-runner/src/nwave-invocation/wave-progress-translator.ts:19:74
   return waves.find((wave) => wave.processId === processId);
 }
 
-function toWaveStartedEvent(wave: NwaveRunWave): WaveProgressDomainEvent {
-  return { type: "nwave.run.wave_started", runId: wave.runId, waveName: wave.waveName };
-}
+function toWaveStartedEvent(wave: NwaveRunWave): WaveProgressDomainEvent {}
 
 function toWaveCompletedEvent(wave: NwaveRunWave): WaveProgressDomainEvent {
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a run's wave-progress signal is derived from process lifecycle events, not from parsing agent output
statusReason: expected [ undefined, { …(3) } ] to deeply equal [ { …(3) }, { …(3) } ]

[Killed] BlockStatement
agent-runner/src/nwave-invocation/wave-progress-translator.ts:23:76
   return { type: "nwave.run.wave_started", runId: wave.runId, waveName: wave.waveName };
 }
 
-function toWaveCompletedEvent(wave: NwaveRunWave): WaveProgressDomainEvent {
-  return { type: "nwave.run.wave_completed", runId: wave.runId, waveName: wave.waveName };
-}
+function toWaveCompletedEvent(wave: NwaveRunWave): WaveProgressDomainEvent {}
 
 function toWaveFailedEvent(wave: NwaveRunWave, exitCode: number | null): WaveProgressDomainEvent {
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a run's wave-progress signal is derived from process lifecycle events, not from parsing agent output
statusReason: expected [ { …(3) }, undefined ] to deeply equal [ { …(3) }, { …(3) } ]

[Killed] StringLiteral
agent-runner/src/nwave-invocation/wave-progress-translator.ts:24:18
 }
 
 function toWaveCompletedEvent(wave: NwaveRunWave): WaveProgressDomainEvent {
-  return { type: "nwave.run.wave_completed", runId: wave.runId, waveName: wave.waveName };
+  return { type: "", runId: wave.runId, waveName: wave.waveName };
 }
 
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a run's wave-progress signal is derived from process lifecycle events, not from parsing agent output
statusReason: expected [ { …(3) }, { type: '', …(2) } ] to deeply equal [ { …(3) }, { …(3) } ]

[Killed] BlockStatement
agent-runner/src/nwave-invocation/wave-progress-translator.ts:27:98
   return { type: "nwave.run.wave_completed", runId: wave.runId, waveName: wave.waveName };
 }
 
-function toWaveFailedEvent(wave: NwaveRunWave, exitCode: number | null): WaveProgressDomainEvent {
-  return { type: "nwave.run.wave_failed", runId: wave.runId, waveName: wave.waveName, exitCode };
-}
+function toWaveFailedEvent(wave: NwaveRunWave, exitCode: number | null): WaveProgressDomainEvent {}
 
 function sortByCreatedAt(events: ProcessLifecycleEvent[]): ProcessLifecycleEvent[] {
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a wave process's non-zero exit derives a wave-failed event (never wave-completed), and non-terminal or unmatche
statusReason: expected [ { …(3) }, undefined ] to deeply equal [ { …(3) }, { …(4) } ]

[Killed] ObjectLiteral
agent-runner/src/nwave-invocation/wave-progress-translator.ts:28:10
 }
 
 function toWaveFailedEvent(wave: NwaveRunWave, exitCode: number | null): WaveProgressDomainEvent {
-  return { type: "nwave.run.wave_failed", runId: wave.runId, waveName: wave.waveName, exitCode };
+  return {};
 }
 
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a wave process's non-zero exit derives a wave-failed event (never wave-completed), and non-terminal or unmatche
statusReason: expected [ { …(3) }, {} ] to deeply equal [ { …(3) }, { …(4) } ]

[Killed] BlockStatement
agent-runner/src/nwave-invocation/wave-progress-translator.ts:31:84
   return { type: "nwave.run.wave_failed", runId: wave.runId, waveName: wave.waveName, exitCode };
 }
 
-function sortByCreatedAt(events: ProcessLifecycleEvent[]): ProcessLifecycleEvent[] {
-  return [...events].sort((left, right) => (left.createdAt ?? 0) - (right.createdAt ?? 0));
-}
+function sortByCreatedAt(events: ProcessLifecycleEvent[]): ProcessLifecycleEvent[] {}
 
 function deriveEventForLifecycleEvent(
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a run's wave-progress signal is derived from process lifecycle events, not from parsing agent output
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
agent-runner/src/nwave-invocation/wave-progress-translator.ts:32:27
 }
 
 function sortByCreatedAt(events: ProcessLifecycleEvent[]): ProcessLifecycleEvent[] {
-  return [...events].sort((left, right) => (left.createdAt ?? 0) - (right.createdAt ?? 0));
+  return [...events].sort(() => undefined);
 }
 
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] lifecycle events are translated in true chronological order, not array position, and each is attributed to the 
statusReason: expected [ { …(3) }, { …(3) }, { …(3) }, …(1) ] to deeply equal [ { …(3) }, { …(3) }, { …(3) }, …(1) ]

[Killed] LogicalOperator
agent-runner/src/nwave-invocation/wave-progress-translator.ts:32:69
 }
 
 function sortByCreatedAt(events: ProcessLifecycleEvent[]): ProcessLifecycleEvent[] {
-  return [...events].sort((left, right) => (left.createdAt ?? 0) - (right.createdAt ?? 0));
+  return [...events].sort((left, right) => (left.createdAt ?? 0) - (right.createdAt && 0));
 }
 
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] lifecycle events are translated in true chronological order, not array position, and each is attributed to the 
statusReason: expected [ { …(3) }, { …(3) }, { …(3) }, …(1) ] to deeply equal [ { …(3) }, { …(3) }, { …(3) }, …(1) ]

[Killed] BlockStatement
agent-runner/src/nwave-invocation/wave-progress-translator.ts:38:35
 function deriveEventForLifecycleEvent(
   event: ProcessLifecycleEvent,
   waves: NwaveRunWave[],
-): WaveProgressDomainEvent | null {
-  const wave = findWaveByProcessId(waves, event.processId);
-  if (!wave) return null;
-  if (event.type === "process.started") return toWaveStartedEvent(wave);
-  if (event.type === "process.exited") {
-    const exitCode = event.exitCode ?? null;
-    return exitCode === 0 ? toWaveCompletedEvent(wave) : toWaveFailedEvent(wave, exitCode);
-  }
-  return null;
-}
+): WaveProgressDomainEvent | null {}
 
 /**
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a run's wave-progress signal is derived from process lifecycle events, not from parsing agent output
statusReason: expected [ undefined, undefined ] to deeply equal [ { …(3) }, { …(3) } ]

[Killed] ConditionalExpression
agent-runner/src/nwave-invocation/wave-progress-translator.ts:40:7
   waves: NwaveRunWave[],
 ): WaveProgressDomainEvent | null {
   const wave = findWaveByProcessId(waves, event.processId);
-  if (!wave) return null;
+  if (true) return null;
   if (event.type === "process.started") return toWaveStartedEvent(wave);
   if (event.type === "process.exited") {
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a run's wave-progress signal is derived from process lifecycle events, not from parsing agent output
statusReason: expected [] to deeply equal [ { …(3) }, { …(3) } ]

[Killed] BooleanLiteral
agent-runner/src/nwave-invocation/wave-progress-translator.ts:40:7
   waves: NwaveRunWave[],
 ): WaveProgressDomainEvent | null {
   const wave = findWaveByProcessId(waves, event.processId);
-  if (!wave) return null;
+  if (wave) return null;
   if (event.type === "process.started") return toWaveStartedEvent(wave);
   if (event.type === "process.exited") {
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a run's wave-progress signal is derived from process lifecycle events, not from parsing agent output
statusReason: expected [] to deeply equal [ { …(3) }, { …(3) } ]

[Killed] ConditionalExpression
agent-runner/src/nwave-invocation/wave-progress-translator.ts:41:7
 ): WaveProgressDomainEvent | null {
   const wave = findWaveByProcessId(waves, event.processId);
   if (!wave) return null;
-  if (event.type === "process.started") return toWaveStartedEvent(wave);
+  if (false) return toWaveStartedEvent(wave);
   if (event.type === "process.exited") {
     const exitCode = event.exitCode ?? null;
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a run's wave-progress signal is derived from process lifecycle events, not from parsing agent output
statusReason: expected [ { …(3) } ] to deeply equal [ { …(3) }, { …(3) } ]

[Killed] EqualityOperator
agent-runner/src/nwave-invocation/wave-progress-translator.ts:41:7
 ): WaveProgressDomainEvent | null {
   const wave = findWaveByProcessId(waves, event.processId);
   if (!wave) return null;
-  if (event.type === "process.started") return toWaveStartedEvent(wave);
+  if (event.type !== "process.started") return toWaveStartedEvent(wave);
   if (event.type === "process.exited") {
     const exitCode = event.exitCode ?? null;
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a run's wave-progress signal is derived from process lifecycle events, not from parsing agent output
statusReason: expected [ { …(3) } ] to deeply equal [ { …(3) }, { …(3) } ]

[Killed] ConditionalExpression
agent-runner/src/nwave-invocation/wave-progress-translator.ts:42:7
   const wave = findWaveByProcessId(waves, event.processId);
   if (!wave) return null;
   if (event.type === "process.started") return toWaveStartedEvent(wave);
-  if (event.type === "process.exited") {
+  if (true) {
     const exitCode = event.exitCode ?? null;
     return exitCode === 0 ? toWaveCompletedEvent(wave) : toWaveFailedEvent(wave, exitCode);
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a wave process's non-zero exit derives a wave-failed event (never wave-completed), and non-terminal or unmatche
statusReason: expected [ { …(3) }, { …(4) }, { …(4) } ] to deeply equal [ { …(3) }, { …(4) } ]

[Killed] BlockStatement
agent-runner/src/nwave-invocation/wave-progress-translator.ts:42:40
   const wave = findWaveByProcessId(waves, event.processId);
   if (!wave) return null;
   if (event.type === "process.started") return toWaveStartedEvent(wave);
-  if (event.type === "process.exited") {
-    const exitCode = event.exitCode ?? null;
-    return exitCode === 0 ? toWaveCompletedEvent(wave) : toWaveFailedEvent(wave, exitCode);
-  }
+  if (event.type === "process.exited") {}
   return null;
 }
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a run's wave-progress signal is derived from process lifecycle events, not from parsing agent output
statusReason: expected [ { …(3) } ] to deeply equal [ { …(3) }, { …(3) } ]

[Killed] LogicalOperator
agent-runner/src/nwave-invocation/wave-progress-translator.ts:43:22
   if (!wave) return null;
   if (event.type === "process.started") return toWaveStartedEvent(wave);
   if (event.type === "process.exited") {
-    const exitCode = event.exitCode ?? null;
+    const exitCode = event.exitCode && null;
     return exitCode === 0 ? toWaveCompletedEvent(wave) : toWaveFailedEvent(wave, exitCode);
   }
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a wave process's non-zero exit derives a wave-failed event (never wave-completed), and non-terminal or unmatche
statusReason: expected [ { …(3) }, { …(4) } ] to deeply equal [ { …(3) }, { …(4) } ]

[Killed] EqualityOperator
agent-runner/src/nwave-invocation/wave-progress-translator.ts:44:12
   if (event.type === "process.started") return toWaveStartedEvent(wave);
   if (event.type === "process.exited") {
     const exitCode = event.exitCode ?? null;
-    return exitCode === 0 ? toWaveCompletedEvent(wave) : toWaveFailedEvent(wave, exitCode);
+    return exitCode !== 0 ? toWaveCompletedEvent(wave) : toWaveFailedEvent(wave, exitCode);
   }
   return null;
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a run's wave-progress signal is derived from process lifecycle events, not from parsing agent output
statusReason: expected [ { …(3) }, { …(4) } ] to deeply equal [ { …(3) }, { …(3) } ]

[Killed] ConditionalExpression
agent-runner/src/nwave-invocation/wave-progress-translator.ts:44:12
   if (event.type === "process.started") return toWaveStartedEvent(wave);
   if (event.type === "process.exited") {
     const exitCode = event.exitCode ?? null;
-    return exitCode === 0 ? toWaveCompletedEvent(wave) : toWaveFailedEvent(wave, exitCode);
+    return false ? toWaveCompletedEvent(wave) : toWaveFailedEvent(wave, exitCode);
   }
   return null;
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a run's wave-progress signal is derived from process lifecycle events, not from parsing agent output
statusReason: expected [ { …(3) }, { …(4) } ] to deeply equal [ { …(3) }, { …(3) } ]

[Killed] BlockStatement
agent-runner/src/nwave-invocation/wave-progress-translator.ts:63:31
 export function deriveWaveProgressEvents(input: {
   events: ProcessLifecycleEvent[];
   waves: NwaveRunWave[];
-}): WaveProgressDomainEvent[] {
-  return sortByCreatedAt(input.events)
-    .map((event) => deriveEventForLifecycleEvent(event, input.waves))
-    .filter((event): event is WaveProgressDomainEvent => event !== null);
-}
+}): WaveProgressDomainEvent[] {}
 
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a run's wave-progress signal is derived from process lifecycle events, not from parsing agent output
statusReason: expected undefined to deeply equal [ { …(3) }, { …(3) } ]

[Killed] MethodExpression
agent-runner/src/nwave-invocation/wave-progress-translator.ts:64:10
   events: ProcessLifecycleEvent[];
   waves: NwaveRunWave[];
 }): WaveProgressDomainEvent[] {
-  return sortByCreatedAt(input.events)
-    .map((event) => deriveEventForLifecycleEvent(event, input.waves))
-    .filter((event): event is WaveProgressDomainEvent => event !== null);
+  return sortByCreatedAt(input.events).map(event => deriveEventForLifecycleEvent(event, input.waves));
 }
 
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a wave process's non-zero exit derives a wave-failed event (never wave-completed), and non-terminal or unmatche
statusReason: expected [ { …(3) }, null, null, { …(4) } ] to deeply equal [ { …(3) }, { …(4) } ]

[Killed] ArrowFunction
agent-runner/src/nwave-invocation/wave-progress-translator.ts:65:10
   waves: NwaveRunWave[];
 }): WaveProgressDomainEvent[] {
   return sortByCreatedAt(input.events)
-    .map((event) => deriveEventForLifecycleEvent(event, input.waves))
+    .map(() => undefined)
     .filter((event): event is WaveProgressDomainEvent => event !== null);
 }
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a run's wave-progress signal is derived from process lifecycle events, not from parsing agent output
statusReason: expected [ undefined, undefined ] to deeply equal [ { …(3) }, { …(3) } ]

[Killed] ConditionalExpression
agent-runner/src/nwave-invocation/wave-progress-translator.ts:66:58
 }): WaveProgressDomainEvent[] {
   return sortByCreatedAt(input.events)
     .map((event) => deriveEventForLifecycleEvent(event, input.waves))
-    .filter((event): event is WaveProgressDomainEvent => event !== null);
+    .filter((event): event is WaveProgressDomainEvent => true);
 }
 
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a wave process's non-zero exit derives a wave-failed event (never wave-completed), and non-terminal or unmatche
statusReason: expected [ { …(3) }, null, null, { …(4) } ] to deeply equal [ { …(3) }, { …(4) } ]

[Killed] ConditionalExpression
agent-runner/src/nwave-invocation/wave-progress-translator.ts:66:58
 }): WaveProgressDomainEvent[] {
   return sortByCreatedAt(input.events)
     .map((event) => deriveEventForLifecycleEvent(event, input.waves))
-    .filter((event): event is WaveProgressDomainEvent => event !== null);
+    .filter((event): event is WaveProgressDomainEvent => false);
 }
 
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a run's wave-progress signal is derived from process lifecycle events, not from parsing agent output
statusReason: expected [] to deeply equal [ { …(3) }, { …(3) } ]
