[Killed] BlockStatement
agent-runner/src/nwave-invocation/wave-runner.ts:29:57
 const FIRST_WAVE_NAME: WaveName = WAVE_SEQUENCE[0];
 const FIRST_WAVE_SEQUENCE = 1;
 
-function waveSequenceNumber(waveName: WaveName): number {
-  return WAVE_SEQUENCE.indexOf(waveName) + 1;
-}
+function waveSequenceNumber(waveName: WaveName): number {}
 
 async function startWaveProcess(
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@property @US-04] the run id remains stable and is referenced by every wave transition for the life of the run
statusReason: recordWaveStarted failed with status 400: {"error":"sequence is required"}

[Killed] ArithmeticOperator
agent-runner/src/nwave-invocation/wave-runner.ts:30:10
 const FIRST_WAVE_SEQUENCE = 1;
 
 function waveSequenceNumber(waveName: WaveName): number {
-  return WAVE_SEQUENCE.indexOf(waveName) + 1;
+  return WAVE_SEQUENCE.indexOf(waveName) - 1;
 }
 
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] wave chaining follows DISCUSS, DESIGN, DISTILL, DELIVER in order, and the run completes once DELIVER exits clea
statusReason: expected [ Array(4) ] to deeply equal [ Array(4) ]

[Killed] BlockStatement
agent-runner/src/nwave-invocation/wave-runner.ts:36:35
 async function startWaveProcess(
   input: { ticketRef: string; waveName: WaveName },
   deps: WaveRunnerDependencies,
-): Promise<{ processId: string }> {
-  const cmd = deps.buildWaveCommand(input);
-  return deps.shellStart({ cmd, cwd: process.cwd() });
-}
+): Promise<{ processId: string }> {}
 
 function describeSpawnFailure(waveName: WaveName, error: unknown): string {
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@walking_skeleton @real-io @in-memory @driving_port @US-04] Maria confirms the system's understood intent and an nWave 
statusReason: expected [ 'STARTING', 'RUNNING' ] to include 'START_FAILED'

[Killed] BlockStatement
agent-runner/src/nwave-invocation/wave-runner.ts:41:75
   return deps.shellStart({ cmd, cwd: process.cwd() });
 }
 
-function describeSpawnFailure(waveName: WaveName, error: unknown): string {
-  const message = error instanceof Error ? error.message : String(error);
-  return `Could not start ${waveName}: the execution environment is unavailable (${message})`;
-}
+function describeSpawnFailure(waveName: WaveName, error: unknown): string {}
 
 /**
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] Maria is told clearly a run could not start when the execution environment is unavailable, never shown false pr
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] StringLiteral
agent-runner/src/nwave-invocation/wave-runner.ts:43:10
 
 function describeSpawnFailure(waveName: WaveName, error: unknown): string {
   const message = error instanceof Error ? error.message : String(error);
-  return `Could not start ${waveName}: the execution environment is unavailable (${message})`;
+  return ``;
 }
 
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] Maria is told clearly a run could not start when the execution environment is unavailable, never shown false pr
statusReason: expected '' to contain 'DISCUSS'

[Killed] BlockStatement
agent-runner/src/nwave-invocation/wave-runner.ts:76:7
   const confirmed = await deps.runRepository.confirmRun({ runId: created.id });
 
   let startedProcessId: string;
-  try {
-    ({ processId: startedProcessId } = await startWaveProcess(
-      { ticketRef: input.ticketRef, waveName: FIRST_WAVE_NAME },
-      deps,
-    ));
-  } catch (error) {
+  try {} catch (error) {
     return deps.runRepository.haltRun({
       runId: confirmed.id,
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@walking_skeleton @real-io @in-memory @driving_port @US-04] Maria confirms the system's understood intent and an nWave 
statusReason: recordWaveStarted failed with status 400: {"error":"processId is required"}

[Killed] BlockStatement
agent-runner/src/nwave-invocation/wave-runner.ts:81:19
       { ticketRef: input.ticketRef, waveName: FIRST_WAVE_NAME },
       deps,
     ));
-  } catch (error) {
-    return deps.runRepository.haltRun({
-      runId: confirmed.id,
-      reason: describeSpawnFailure(FIRST_WAVE_NAME, error),
-    });
-  }
+  } catch (error) {}
 
   await deps.runRepository.recordWaveStarted({
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] Maria is told clearly a run could not start when the execution environment is unavailable, never shown false pr
statusReason: recordWaveStarted failed with status 400: {"error":"processId is required"}

[Killed] ObjectLiteral
agent-runner/src/nwave-invocation/wave-runner.ts:82:39
       deps,
     ));
   } catch (error) {
-    return deps.runRepository.haltRun({
-      runId: confirmed.id,
-      reason: describeSpawnFailure(FIRST_WAVE_NAME, error),
-    });
+    return deps.runRepository.haltRun({});
   }
 
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] Maria is told clearly a run could not start when the execution environment is unavailable, never shown false pr
statusReason: haltRun failed with status 404: {"error":"Run not found"}

[Killed] ObjectLiteral
agent-runner/src/nwave-invocation/wave-runner.ts:88:46
     });
   }
 
-  await deps.runRepository.recordWaveStarted({
-    runId: confirmed.id,
-    waveName: FIRST_WAVE_NAME,
-    sequence: FIRST_WAVE_SEQUENCE,
-    processId: startedProcessId,
-  });
+  await deps.runRepository.recordWaveStarted({});
 
   return confirmed;
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@walking_skeleton @real-io @in-memory @driving_port @US-04] Maria confirms the system's understood intent and an nWave 
statusReason: recordWaveStarted failed with status 404: {"error":"Run not found"}

[Killed] BlockStatement
agent-runner/src/nwave-invocation/wave-runner.ts:101:29
 function findRunningWave(
   waves: NwaveRunWave[],
   waveName: WaveName,
-): NwaveRunWave | undefined {
-  return waves.find((wave) => wave.waveName === waveName && wave.status === "RUNNING");
-}
+): NwaveRunWave | undefined {}
 
 /**
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@property @US-04] the run id remains stable and is referenced by every wave transition for the life of the run
statusReason: expected undefined to be 'RUN-62F124FC' // Object.is equality

[Killed] ConditionalExpression
agent-runner/src/nwave-invocation/wave-runner.ts:102:31
   waves: NwaveRunWave[],
   waveName: WaveName,
 ): NwaveRunWave | undefined {
-  return waves.find((wave) => wave.waveName === waveName && wave.status === "RUNNING");
+  return waves.find((wave) => true);
 }
 
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] wave chaining follows DISCUSS, DESIGN, DISTILL, DELIVER in order, and the run completes once DELIVER exits clea
statusReason: expected 'RUNNING' to be 'COMPLETED' // Object.is equality

[Killed] ConditionalExpression
agent-runner/src/nwave-invocation/wave-runner.ts:102:31
   waves: NwaveRunWave[],
   waveName: WaveName,
 ): NwaveRunWave | undefined {
-  return waves.find((wave) => wave.waveName === waveName && wave.status === "RUNNING");
+  return waves.find((wave) => true && wave.status === "RUNNING");
 }
 
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a wave-completion notification for a run that does not exist, or that names a wave which is not currently runni
statusReason: expected { …(9) } to be null

[Killed] BlockStatement
agent-runner/src/nwave-invocation/wave-runner.ts:120:18
 async function recordWaveFailure(
   input: { runId: string; waveId: string; waveName: WaveName; exitCode: number },
   deps: WaveRunnerDependencies,
-): Promise<null> {
-  await deps.runRepository.recordWaveFailed({
-    runId: input.runId,
-    waveId: input.waveId,
-    exitCode: input.exitCode,
-    failureReason: `${input.waveName} exited with code ${input.exitCode}`,
-  });
-  return null;
-}
+): Promise<null> {}
 
 async function recordCompletionAndStartNextWave(
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a wave that exits with a non-zero code fails the run and halts the chain without starting the next wave
statusReason: expected undefined to be null

[Killed] ObjectLiteral
agent-runner/src/nwave-invocation/wave-runner.ts:121:45
   input: { runId: string; waveId: string; waveName: WaveName; exitCode: number },
   deps: WaveRunnerDependencies,
 ): Promise<null> {
-  await deps.runRepository.recordWaveFailed({
-    runId: input.runId,
-    waveId: input.waveId,
-    exitCode: input.exitCode,
-    failureReason: `${input.waveName} exited with code ${input.exitCode}`,
-  });
+  await deps.runRepository.recordWaveFailed({});
   return null;
 }
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a wave that exits with a non-zero code fails the run and halts the chain without starting the next wave
statusReason: recordWaveFailed failed with status 404: {"error":"Run not found"}

[Killed] BlockStatement
agent-runner/src/nwave-invocation/wave-runner.ts:139:33
     exitCode: number;
   },
   deps: WaveRunnerDependencies,
-): Promise<NwaveRunWave | null> {
-  await deps.runRepository.recordWaveCompleted({
-    runId: input.runId,
-    waveId: input.waveId,
-    exitCode: input.exitCode,
-  });
-
-  const nextWaveName = nextWaveAfter(input.completedWaveName);
-  if (nextWaveName === null) {
-    return null;
-  }
-
-  const { processId } = await startWaveProcess(
-    { ticketRef: input.ticketRef, waveName: nextWaveName },
-    deps,
-  );
-
-  return deps.runRepository.recordWaveStarted({
-    runId: input.runId,
-    waveName: nextWaveName,
-    sequence: waveSequenceNumber(nextWaveName),
-    processId,
-  });
-}
+): Promise<NwaveRunWave | null> {}
 
 export async function advanceToNextWave(
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@property @US-04] the run id remains stable and is referenced by every wave transition for the life of the run
statusReason: expected undefined to be 'RUN-31E8711B' // Object.is equality

[Killed] BlockStatement
agent-runner/src/nwave-invocation/wave-runner.ts:147:30
   });
 
   const nextWaveName = nextWaveAfter(input.completedWaveName);
-  if (nextWaveName === null) {
-    return null;
-  }
+  if (nextWaveName === null) {}
 
   const { processId } = await startWaveProcess(
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] wave chaining follows DISCUSS, DESIGN, DISTILL, DELIVER in order, and the run completes once DELIVER exits clea
statusReason: recordWaveStarted failed with status 400: {"error":"waveName is required"}

[Killed] ConditionalExpression
agent-runner/src/nwave-invocation/wave-runner.ts:147:7
   });
 
   const nextWaveName = nextWaveAfter(input.completedWaveName);
-  if (nextWaveName === null) {
+  if (false) {
     return null;
   }
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] wave chaining follows DISCUSS, DESIGN, DISTILL, DELIVER in order, and the run completes once DELIVER exits clea
statusReason: recordWaveStarted failed with status 400: {"error":"waveName is required"}

[Killed] BlockStatement
agent-runner/src/nwave-invocation/wave-runner.ts:169:13
   deps: WaveRunnerDependencies,
 ): Promise<NwaveRunWave | null> {
   const run = await deps.runRepository.getRun({ runId: input.runId });
-  if (!run) {
-    return null;
-  }
+  if (!run) {}
 
   const completedWave = findRunningWave(run.waves, input.completedWaveName);
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a wave-completion notification for a run that does not exist, or that names a wave which is not currently runni
statusReason: Cannot read properties of null (reading 'waves')

[Killed] ConditionalExpression
agent-runner/src/nwave-invocation/wave-runner.ts:169:7
   deps: WaveRunnerDependencies,
 ): Promise<NwaveRunWave | null> {
   const run = await deps.runRepository.getRun({ runId: input.runId });
-  if (!run) {
+  if (true) {
     return null;
   }
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@property @US-04] the run id remains stable and is referenced by every wave transition for the life of the run
statusReason: expected undefined to be 'RUN-60479EDB' // Object.is equality

[Killed] BooleanLiteral
agent-runner/src/nwave-invocation/wave-runner.ts:174:7
   }
 
   const completedWave = findRunningWave(run.waves, input.completedWaveName);
-  if (!completedWave) {
+  if (completedWave) {
     return null;
   }
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@property @US-04] the run id remains stable and is referenced by every wave transition for the life of the run
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
agent-runner/src/nwave-invocation/wave-runner.ts:174:7
   }
 
   const completedWave = findRunningWave(run.waves, input.completedWaveName);
-  if (!completedWave) {
+  if (false) {
     return null;
   }
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a wave-completion notification for a run that does not exist, or that names a wave which is not currently runni
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
agent-runner/src/nwave-invocation/wave-runner.ts:178:7
     return null;
   }
 
-  if (input.exitCode !== 0) {
+  if (input.exitCode === 0) {
     return recordWaveFailure(
       {
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@property @US-04] the run id remains stable and is referenced by every wave transition for the life of the run
statusReason: expected undefined to be 'RUN-29081D01' // Object.is equality

[Killed] BlockStatement
agent-runner/src/nwave-invocation/wave-runner.ts:178:29
     return null;
   }
 
-  if (input.exitCode !== 0) {
-    return recordWaveFailure(
-      {
-        runId: input.runId,
-        waveId: completedWave.id,
-        waveName: input.completedWaveName,
-        exitCode: input.exitCode,
-      },
-      deps,
-    );
-  }
+  if (input.exitCode !== 0) {}
 
   return recordCompletionAndStartNextWave(
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a wave that exits with a non-zero code fails the run and halts the chain without starting the next wave
statusReason: expected { …(9) } to be null

[Killed] ObjectLiteral
agent-runner/src/nwave-invocation/wave-runner.ts:180:7
 
   if (input.exitCode !== 0) {
     return recordWaveFailure(
-      {
-        runId: input.runId,
-        waveId: completedWave.id,
-        waveName: input.completedWaveName,
-        exitCode: input.exitCode,
-      },
+      {},
       deps,
     );
killedBy: US-04: a confirmed development-work ticket triggers an nWave implementation run [@US-04] a wave that exits with a non-zero code fails the run and halts the chain without starting the next wave
statusReason: recordWaveFailed failed with status 404: {"error":"Run not found"}
